Revit 2027 API
ExternalResourceUtils.GetAllExternalResourceReferences(Document, ExternalResourceType) Method
 Gets the ids of all elements which refer to a specific type of external resource.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ISet<ElementId> GetAllExternalResourceReferences(
	Document document,
	ExternalResourceType resourceType
)
Public Shared Function GetAllExternalResourceReferences (
	document As Document,
	resourceType As ExternalResourceType
) As ISet(Of ElementId)
public:
static ISet<ElementId^>^ GetAllExternalResourceReferences(
	Document^ document,
	ExternalResourceType^ resourceType
)
static member GetAllExternalResourceReferences :
        document : Document *
        resourceType : ExternalResourceType -> ISet<ElementId>
Parameters
document Document
 The Revit Document containing the external resource references.
resourceType ExternalResourceType
 The type of external resource.
Return Value
ISet<ElementId>
 The ids of all elements which refer to external resources of the specified type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternalResourceUtils Class
GetAllExternalResourceReferences Overload
Autodesk.Revit.DB Namespace